In [2]:
import pandas

In [3]:
df = pandas.read_csv('hr.csv')
df

  Name Hire Date  Salary  Sick Days Remaining
0   GC  03/15/14   50000                   10
1   JC  06/01/15   65000                    8
2   EI  05/12/14   45000                   10
3   TJ  11/01/13   70000                    3

In [3]:
type(df)

pandas.core.frame.DataFrame

In [5]:
df.columns

Index(['Name', 'Hire Date', 'Salary', 'Sick Days Remaining'], dtype='object')

In [6]:
len(df)

4

In [7]:
for i in df: print(i)

Name
Hire Date
Salary
Sick Days Remaining

In [8]:
df

  Name Hire Date  Salary  Sick Days Remaining
0   GC  03/15/14   50000                   10
1   JC  06/01/15   65000                    8
2   EI  05/12/14   45000                   10
3   TJ  11/01/13   70000                    3

In [10]:
df['Name']

0    GC
1    JC
2    EI
3    TJ
Name: Name, dtype: object

In [12]:
df['Salary'][2]

45000

In [13]:
df[2]['Salary']

KeyError: 2

In [14]:
for i in df:
    print(df[i][2])

EI
05/12/14
45000
10

In [15]:
df

  Name Hire Date  Salary  Sick Days Remaining
0   GC  03/15/14   50000                   10
1   JC  06/01/15   65000                    8
2   EI  05/12/14   45000                   10
3   TJ  11/01/13   70000                    3

In [4]:
df1 = pandas.read_csv('hr.csv', index_col = 'Name')
df1

     Hire Date  Salary  Sick Days Remaining
Name
GC    03/15/14   50000                   10
JC    06/01/15   65000                    8
EI    05/12/14   45000                   10
TJ    11/01/13   70000                    3

In [17]:
for i in df1: print(i)

Hire Date
Salary
Sick Days Remaining

In [19]:
df1['Name']

KeyError: 'Name'

In [22]:
df

  Name Hire Date  Salary  Sick Days Remaining
0   GC  03/15/14   50000                   10
1   JC  06/01/15   65000                    8
2   EI  05/12/14   45000                   10
3   TJ  11/01/13   70000                    3

In [24]:
df.iloc[0]

Name                         GC
Hire Date              03/15/14
Salary                    50000
Sick Days Remaining          10
Name: 0, dtype: object

In [27]:
df1.iloc[0]

Hire Date              03/15/14
Salary                    50000
Sick Days Remaining          10
Name: GC, dtype: object

In [30]:
df.head(2)

  Name Hire Date  Salary  Sick Days Remaining
0   GC  03/15/14   50000                   10
1   JC  06/01/15   65000                    8

In [31]:
df

  Name Hire Date  Salary  Sick Days Remaining
0   GC  03/15/14   50000                   10
1   JC  06/01/15   65000                    8
2   EI  05/12/14   45000                   10
3   TJ  11/01/13   70000                    3

In [36]:
df2 = pandas.read_csv('hr.csv', header = 0, names = ['Initials', 'DOJ', 'BP', 'Leaves'])
df2

  Initials       DOJ     BP  Leaves
0       GC  03/15/14  50000      10
1       JC  06/01/15  65000       8
2       EI  05/12/14  45000      10
3       TJ  11/01/13  70000       3

In [38]:
df3 = pandas.read_csv('hr.csv', header = 0, names = ['Initials', 'Hire Date', 'Salary', 'Sick Days Remaining'])
df3

  Initials Hire Date  Salary  Sick Days Remaining
0       GC  03/15/14   50000                   10
1       JC  06/01/15   65000                    8
2       EI  05/12/14   45000                   10
3       TJ  11/01/13   70000                    3

In [39]:
df

  Name Hire Date  Salary  Sick Days Remaining
0   GC  03/15/14   50000                   10
1   JC  06/01/15   65000                    8
2   EI  05/12/14   45000                   10
3   TJ  11/01/13   70000                    3

In [40]:
df3

  Initials Hire Date  Salary  Sick Days Remaining
0       GC  03/15/14   50000                   10
1       JC  06/01/15   65000                    8
2       EI  05/12/14   45000                   10
3       TJ  11/01/13   70000                    3

In [47]:
df3['Empty'] = None #= [9988990099, 8899009988, 8877889988, 9977889977]

In [48]:
df3

  Initials Hire Date  Salary  Sick Days Remaining       Phone Empty
0       GC  03/15/14   50000                   10  9988990099  None
1       JC  06/01/15   65000                    8  8899009988  None
2       EI  05/12/14   45000                   10  8877889988  None
3       TJ  11/01/13   70000                    3  9977889977  None

In [49]:
df3.to_csv('hr1.csv')